INSERT INTO students (name, ruby, nickname, email, address, age, gender) VALUES
('北海正己', 'ほっかいまさみ', 'ホッカイくん', 'todoroki@example.com', '北海道札幌市', 22, '男'),
('佐藤花子', 'さとうはなこ', 'ハナちゃん', 'hanako.sato@example.com', '神奈川県横浜市', 25, '女'),
('山田太郎', 'やまだたろう', 'タロちゃん', 'taro.yamada@example.com', '大阪府大阪市', 30, 'その他'),
('川島梅子', 'かわしまうめこ', 'ウメちゃん', 'ume@example.com', '山口県山口市', 18, '女'),
('田中検事', 'たなかけんじ', 'ケンちゃん', 'kenji@example.com', '徳島県徳島市', 36, '男'),
('東北清子', 'とうほくきよこ', 'キヨちゃん', 'kiyo@example.com', '宮城県仙台市', 26, '女');

INSERT INTO students_courses (student_id, course_name, start_date, end_date) VALUES
(1, 'web開発基礎', '2024-11-03 00:00:00', '2025-11-03 00:00:00'),
(2, 'Webマーケティングコース', '2024-11-10 00:00:00', '2025-11-10 00:00:00'),
(2, 'バックエンド開発', '2024-01-10 00:00:00', '2024-03-10 00:00:00'),
(3, 'データベース入門', '2024-02-15 00:00:00', '2024-04-15 00:00:00'),
(4, 'ウェブ開発基礎', '2024-03-01 00:00:00', '2024-05-01 00:00:00'),
(5, 'ウェブ開発基礎', '2024-03-11 00:00:00', '2024-05-10 00:00:00'),
(6, 'フロントエンド開発', '2024-10-19 00:00:00', '2025-10-19 00:00:00'),
(6, 'データベース設計', '2024-10-25 00:00:00', '2025-10-25 00:00:00');
